InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦветаОформления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦветаОформления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ЦветаОформления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЦветаОформления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МестоХраненияПрикрепленныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МестоХраненияПрикрепленныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийДисковыйРесурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначенияПовтИсп/Ext/Module.bsl
// © Primus1C  06.11.2023  НАЧАЛО ►

Функция ОписаниеТипаВсеСсылки() Экспорт
	
	Возврат Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
		Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
			Справочники.ТипВсеСсылки(),
			Документы.ТипВсеСсылки().Типы()),
			ПланыОбмена.ТипВсеСсылки().Типы()),
			Перечисления.ТипВсеСсылки().Типы()),
			ПланыВидовХарактеристик.ТипВсеСсылки().Типы()),
			ПланыСчетов.ТипВсеСсылки().Типы()),
			ПланыВидовРасчета.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().Типы()),
			Задачи.ТипВсеСсылки().Типы());
	
КонецФункции

Функция ДоступныеВалюты(Отбор = Неопределено) Экспорт
	
	Валюты 		= Новый СписокЗначений;
	ЦветаВалют 	= ЦветаВалют();
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Валюты.Ссылка,
	             |	Валюты.Код,
	             |	Валюты.ЦветРГБ,
	             |	Валюты.Символ
	             |ИЗ
	             |	Справочник.Валюты КАК Валюты
	             |ГДЕ
	             |	НЕ Валюты.ПометкаУдаления
	             |	И ИСТИНА = ИСТИНА
	             | АВТОУПОРЯДОЧИВАНИЕ";
	Если Отбор <> Неопределено Тогда                         
		Условие = "";
		Для каждого Отб Из Отбор Цикл 
			Если Отб.Значение = Истина Тогда
				ЗначениеОтбора = "ИСТИНА";
			ИначеЕсли Отб.Значение = Ложь Тогда	
				ЗначениеОтбора = "ЛОЖЬ";
			Иначе
				ЗначениеОтбора = Отб.Значение;
			КонецЕсли;
			Условие = СтрШаблон("%1 %2 = %3 И ", Условие, Отб.Ключ, ЗначениеОтбора);
		КонецЦикла;	
		Условие = Лев(Условие, СтрДлина(Условие) - 3);
		Если Условие <> "" Тогда
			Запр.Текст = СтрЗаменить(Запр.Текст, "ИСТИНА = ИСТИНА", Условие);
		КонецЕсли;
	КонецЕсли;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Валюты.Добавить(Выборка.Ссылка, Новый ФорматированнаяСтрока(Выборка.Код + " (" + Выборка.Символ + ")",,, гоЦветРГБ(Выборка.ЦветРГБ),));
	КонецЦикла;
	Возврат Валюты;
	
КонецФункции	

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь - текущий пользователь программы
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Настройка, ПустоеЗначение = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";

	Выборка = Запрос.Выполнить().Выбрать();

	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	КонецЕсли;

	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;

	ИначеЕсли Выборка.Следующий() Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;

	Иначе
		Возврат ПустоеЗначение;

	КонецЕсли;

КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеНастройки(Настройка, ПараметрыСеансаУстановлены = Истина) Экспорт
	
	Запрос = Новый Запрос;   
	Если ПараметрыСеансаУстановлены Тогда
		Запрос.УстановитьПараметр("Пользователь", гоПользователь());
	Иначе
		Запрос.УстановитьПараметр("Пользователь", омСервер.ПолучитьПользователя());
	КонецЕсли;
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
		|
		|ГДЕ
		|	Пользователь = &Пользователь
		| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;  
	
КонецФункции // ПолучитьЗначениеНастройки()

Функция ЦветаВалют() Экспорт

	Соотв = Новый Соответствие;
	Выборка = Справочники.Валюты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Ссылка, гоЦветРГБ(выборка.ЦветРГБ));	
	КонецЦикла;
	Соотв.Вставить(Справочники.Валюты.ПустаяСсылка(), гоЦветРГБ("255,255,255"));	
	Возврат Соотв;

КонецФункции 

Функция ЦветаСтатусов() Экспорт
	
	Соотв = Новый Соответствие;
	Запр = Новый Запрос; 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Значение КАК Цвет,
	             |	ЦветаОформления.Настройка.Наименование КАК Статус
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Настройка.Родитель = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ЦветаОформления.СтатусыИнвойсов)
	             |			ИЛИ ЦветаОформления.Настройка.Родитель = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ЦветаОформления.СтатусыИнспекцииИнвойсов)
	             |			ИЛИ ЦветаОформления.Настройка.Родитель = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ЦветаОформления.СтатусыОплатыИнвойсов)";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Статус, ?(ЗначениеЗаполнено(Выборка.Цвет), гоЦветРГБ(Выборка.Цвет), гоЦветРГБ("255,255,255")));
	КонецЦикла;
	Соотв.Вставить("", гоЦветРГБ("255,255,255"));	
	Возврат Соотв;

КонецФункции 
	
Функция ЦветЭлементаСписка(ИмяЭлемента) Экспорт

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Настройка", ИмяЭлемента);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Значение КАК Цвет
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Настройка.ИмяПредопределенныхДанных = &Настройка";
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Цвет) Тогда
		    Возврат гоЦветРГБ(Выборка.Цвет);
		Иначе	
			Возврат гоЦветРГБ("255,255,255");
		КонецЕсли;	
	Иначе
		Возврат гоЦветРГБ("255,255,255");
	КонецЕсли;

КонецФункции // ЦветЭлементаСписка()

Функция НастройкаХраненияФайлов(ТолькоВИБ = Ложь) Экспорт

	Возврат Новый Структура("МестоХраненияФайлов, КаталогФайлов, ИспользоватьСжатие, МетодСжатия, МаксРазмерФайлаДляИБ",
							?(ТолькоВИБ = Истина, Перечисления.МестоХраненияПрикрепленныхФайлов.ИнформационнаяБаза, Константы.МестоХраненияФайлов.Получить()),
	                        Константы.КаталогФайлов.Получить(),
							Константы.ИспользоватьСжатие.Получить(),
							Константы.МетодСжатия.Получить(),
							Константы.МаксРазмерФайлаДляИБ.Получить());

КонецФункции 


#Область Доступность
	
Функция ДоступныЦеныЗакупки() Экспорт
	
	Возврат РольДоступна("Администратор") ИЛИ 
			РольДоступна("Логистика") ИЛИ 
			РольДоступна("Бухгалтерия") ИЛИ 
			РольДоступна("СверкаСПоставщиками") ИЛИ  
			РольДоступна("МетреонПолный") ИЛИ  
			РольДоступна("ИнвойсЗакупкиМинимальный") ИЛИ  
			РольДоступна("ИнвойсЗакупки") ИЛИ  
			РольДоступна("ИнвойсТоварный") ИЛИ  
			РольДоступна("ЗакупкаПродажаВозврат") ИЛИ  
			РольДоступна("ВидимостьЦенЗакупки");	

КонецФункции 

Функция ЕстьДоступКОстаткамТоваров() Экспорт

	Возврат ПолучитьФункциональнуюОпцию("ОстаткиТоваров", Новый Структура("Пользователь", гоПользователь()));

КонецФункции 

Функция ДоступныНаименованияКонтрагентов() Экспорт

	Возврат РольДоступна("ЧтениеНаименованийКонтрагентов") 
		ИЛИ РольДоступна("ЧтениеИзменениеНаименованийКонтрагентов") 
		ИЛИ РольДоступна("ПриходованиеВводомНаОсновании")
		ИЛИ РольДоступна("Администратор")

КонецФункции 

Функция ДоступБухгалтерии() Экспорт

	Возврат (РольДоступна("Администратор") ИЛИ РольДоступна("Бухгалтерия")) И
			НЕ РольДоступна("api_client");

КонецФункции // ДоступБухгалтерии()

Функция ВидимостьНаценки() Экспорт

	Возврат РольДоступна("ВидимостьНаценки") ИЛИ РольДоступна("Администратор");

КонецФункции    

Функция МассивДоступныхСкладов() Экспорт

	Рез = Новый Массив;
	Если гоПользователь().Складов = 0 Тогда Возврат Рез КонецЕсли; 
	Если гоПользователь().СкладыИсключать Тогда
		Запр = Новый Запрос; 
		Запр.УстановитьПараметр("Исключить", гоПользователь().Склады.ВыгрузитьКолонку(0));
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Ссылка
		             |ИЗ
		             |	Справочник.Склады КАК Склады
		             |ГДЕ
		             |	НЕ Склады.Ссылка В (&Исключить)";
		Рез = Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Иначе	
		Рез = гоПользователь().Склады.ВыгрузитьКолонку(0); 
	КонецЕсли;
	Возврат Рез;
КонецФункции

Функция МассивДоступныхКасс() Экспорт

	Рез = Новый Массив;
	Если гоПользователь().ДенежныхСчетов = 0 Тогда Возврат Рез КонецЕсли;   
	Если гоПользователь().ДенежныеСчетаИсключать Тогда
		Запр = Новый Запрос; 
		Запр.УстановитьПараметр("Исключить", гоПользователь().ДенежныеСчета.ВыгрузитьКолонку(0));
		Запр.Текст = "ВЫБРАТЬ
		             |	ДенежныеСчета.Ссылка
		             |ИЗ
		             |	Справочник.ДенежныеСчета КАК ДенежныеСчета
		             |ГДЕ
		             |	НЕ ДенежныеСчета.Ссылка В (&Исключить)";
		Рез = Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0); 
	Иначе
		Для Каждого Стр Из гоПользователь().ДенежныеСчета Цикл
			Рез.Добавить(Стр.ДенежныйСчет);
		КонецЦикла;    
	КонецЕсли;		
	Возврат Рез;

КонецФункции

#КонецОбласти


Функция СписокСпецификаций() Экспорт

	Спис = Новый СписокЗначений;
	Спис.Добавить("UA", 1);
	Спис.Добавить("EU", 2);  
	Спис.Добавить("KH", 3);  
	Спис.Добавить("Korea", 3); 
	Спис.Добавить("RU", 4);  
	Спис.Добавить("LL", 5);  
	Спис.Добавить("US", 5);  
	Спис.Добавить("AA", 6);   
	Спис.Добавить("AB", 6);   
	Спис.Добавить("AE", 6);   
	Спис.Добавить("AH", 6);   
	Спис.Добавить("AR", 6);   
	Спис.Добавить("Arabic", 6);   
	Спис.Добавить("AU", 7);  
	Спис.Добавить("XA", 7);  
	Спис.Добавить("VC", 8);  
	Спис.Добавить("JA", 9);  
	Спис.Добавить("J/A", 9);  
	Спис.Добавить("JP", 9);  
	Спис.Добавить("KZ", 10);  
	Спис.Добавить("ZP", 11);  
	Спис.Добавить("SG", 11); 
	Спис.Добавить("TW", 12);  
	Спис.Добавить("HN", 13);  
	Спис.Добавить("IN", 13);  
	Спис.Добавить("IND", 13);  
	Спис.Добавить("India", 13);  
	Спис.Добавить("VN", 14);  
	Спис.Добавить("KG", 15);  
	Спис.Добавить("CH", 16);  
	Спис.Добавить("CN", 16);  
	Спис.Добавить("LZ", 17);  
	Спис.Добавить("HK", 18);  
	Спис.Добавить("ZA", 18);  
	Спис.Добавить("PA", 19);  
	Спис.Добавить("BA", 20);  
	Спис.Добавить("UK", 20); 
	Спис.Добавить("TH", 21); 
	Спис.Добавить("MY", 22); // Малайзия
	
	//Спис.Добавить("AFR", ); 
	
	Возврат Спис;

КонецФункции 

Функция ПредустановленнаяДатаУчета(Имя) Экспорт

	Если Имя = "НачалоАвтоматическогоРасчетаКурсаИнвойсов" Тогда
		Возврат Дата(2026, 4, 1);	
	ИначеЕсли Имя = "НачалоИспользованияПривязокИнвойсов" Тогда	
		Возврат Дата(2026, 6, 1);	
	Иначе
		ВызватьИсключение("Ошибка разработки: ОбщегоНазначенияПовтИсп.ПредустановленнаяДатаУчета()", КатегорияОшибки.ОшибкаКонфигурации);
		Возврат Дата(1,1,1);
	КонецЕсли;	

КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄
